#include <stdio.h>
int main(void)
{
/*	p1();
	p2();
	p3();
	p4();
	*/
	//p5();
	//p6();
	//p7();
	//p8();
	//p9();
	//p10();

	// 별찍기 예제들
	//p11();
	//p12();
	//p13();
	//p14();
	//p15();
	//p16();
	//p17();
	//p18();
	
	//p19();
	//p20();
	//p21();
	//p22();
	//p23();
	//p24();
	//p25();


	// programming 예제들
	/*
	pro1();
	pro2();
	pro3();
	pro4(); */
	//pro5();
	//pro6();
	//pro7();
	//pro8();
	//pro9();
	//pro10();
	//pro11();
	//pro12();
	//pro13();
	pro14();

	return 0;
}